In [4]:
import pandas as pd

In [18]:
pd.__version__ # 판다스 버전 확인

'1.0.3'

In [19]:
df = pd.read_csv('data/friend_list.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [20]:
df.head() # head() 기본값은 index( 0부터~4까지) 로우개수 5개를 보여줌.

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [22]:
df.head(1)

   name  age      job
0  John   20  student

In [21]:
df.tail(3) # head() 기본값은 index( 0부터~4까지) 로우개수 5개를 보여줌.

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [25]:
# txt파일 불러오기 
# 메서드가 read_csv()임에도 동일하게 불러와 진다. 
df = pd.read_csv('data/friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [26]:
# 만약 쉽표가 아니라 tab(\t)으로 구분되어 있다면?
df = pd.read_csv('data/friend_list_tab.txt')
df
# 탭의 값도 data안에 들어가 버렸다. 
# 이럴경우 파라미터를 한가지더 추가해줘야한다.!

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [27]:
# delimiter는 경계, 경계 구분의 의미가 있음.
# 즉 경계 구분에 특정한 값을 주면 된다.
df = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [28]:
# 파일에서는 항상 header 정보가 있지요?!
# 만약 header 정보가 없다면?! 
# 그렇다면 header 값을 줘야겠지?!

In [32]:
# panders에 headers가 없다는 사실을 알려줘야함. 
df = pd.read_csv('data/friend_list_no_head.csv', header = None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [34]:
# columns 속성에 값을 대입함. 
df.columns = ['name','age','job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [36]:
# 바로 위 방법은 두단계로 했지만 생성시 바로 값을 부여할 수 있습니다. 
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name','age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern